{"posts":[{"id":"posts-755343018","title":"Introduction","name":"Advantages of storing data on Github","body":"<p>Dashpilot is a hosted headless CMS that saves data to your own GitHub repository. Just authorize Dashpilot to access your Github account, choose a repo and start creating!<\/p><p><strong>Access to a whole ecosystem<\/strong><\/p><p>Dashpilot seemlessly fits into the whole ecosystem of static site generators, build tools, applications and hosting services that work with content and code in your Github repo. Every time you save content from Dashpilot to your Github repo, you can automatically trigger a static site generator to generate a new version of your site, and automatically trigger hosting services like Netlify or Vercel to host the latest version of your site. Dashpilot also works with Single Page Applications built with frameworks like React, Vue or Svelte, no matter if your SPA is hosted through Github or elsewhere.<\/p><p><strong>No vendor lock-in, own your own data<\/strong><\/p><p>Because the data is stored in your own Github Repo, you own and control your data. If you ever decide to choose switch to another CMS, there's nothing to migrate or delete and the data can be easily imported into another CMS. Dashpilot stores no information about you, so moving away is as simple as not using Dashpilot anymore.<\/p><p><strong>Secure<\/strong><\/p><p>Whenever you log in, Dashpilot connects to your Github repo and receives a temporary access token. Once you log out (or the token expires), Dashpilot can not access your Github repo. So you're in control of when Dashpilot has access to your Github account. Furthermore, because of Github's version management features, you can always revert to a previous version of your data if anything goes wrong.<\/p><p><strong>Nothing to install or update<\/strong><\/p><p>Dashpilot is a hosted CMS, so you don't have to install or update any software.<\/p><p><strong>How data is stored<\/strong><\/p><p>All data will be saved as a json file, so you can use it in Single Page Apps without any additional processing or build steps. Any uploaded images are automatically resized and optimized for the web, again saving you additional conversion. To change the default image size, see Configuration options<\/p><p><\/p>","gallery":[],"slug":"introduction-posts-755343018","category":"docs"},{"id":"posts-902559314","title":"Getting started","name":"","body":"<p>Setting up a new site with Dashpilot is as easy as authorizing with Github, and then choosing a repo. All content you create with Dashpilot will be automatically saved to that repo.<\/p><p>Prerequisites<\/p><p>To get started with Dashpilot you need a Github account and at least one repository. If you don't have a Github account already, you can create a free account on (<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http:\/\/Github.com\">Github.com<\/a>)[<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https:\/\/github.com\">https:\/\/github.com<\/a>]. To create a new repository, press the green 'new'-button and on the next screen choose a name, and choose 'initialize the repository with a README'. Then click 'create repository'. If you're new to Github, don't worry, this is all you need to know for now.<\/p><p><\/p>","gallery":[],"slug":"getting-started-posts-902559314","category":"docs"},{"id":1,"title":"Your remote Github CMS","slug":"your-remote-github-cms-1","body":"<p>DashPilot is a free CMS that saves data to your own Github Repo. Just connect DashPilot to your GitHub account and instantly start editing!<\/p>","category":"index","gallery":[],"name":"text-1"},{"id":"posts-952142072","title":"Works with any Static site generator or Single Page App","body":"<p>DashPilot saves your data as JSON to your own Github repo, allowing you to integrate it with many Static Site Generators and Single Page Applications.<\/p>","gallery":[],"slug":"works-with-any-static-site-generator-or-single-page-app-posts-952142072","category":"index","name":"test-2"},{"id":"posts-427396666","title":"Automatically publish to GitHub Pages, Netlify or Vercel","body":"<p>Because your site lives on GitHub, you can automatically publish your site to GitHub Pages, Netlify, Vercel or any other service that works with GitHub.<\/p>","gallery":[],"slug":"automatically-publish-to-github-pages-netlify-or-vercel-posts-427396666","category":"index","name":"text-3"}],"categories":[{"id":"categories-1","type":"default","title":"Home","slug":"index","sub":false},{"id":"categories-275690175","title":"Docs","slug":"docs","type":"default","sub":false,"description":""}],"settings":{"site_title":"Vue Headless CMS","preview_url":"https:\/\/examplepage.net","image_width":800},"ui_settings":{"add_category":true,"delete_category":true,"image_title":true},"fields":{"default":{"title":"text","name":"text","body":"richtext","gallery":"gallery"},"page":{"title":"text","body":"richtext"}}}